/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   algorithm.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: astripeb <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/05/03 21:15:19 by astripeb          #+#    #+#             */
/*   Updated: 2019/05/03 22:03:30 by astripeb         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "tetramino.h"

int		ft_tetra_square(t_tetramino *tet)
{
	int		side;
	char	**map;
	
	//вычисляем для начала наименьший возможный квадрат
	//в зависимости от числа тетрамино
	side = ft_sqr(4 * count_tetramino(tet));
	//запускаем цикл пока не получится уместить
	//все тетрамино в квадрат
	while (1)
	{
		//создаем карту со стороной side
		if (!(map = ft_create_map(side)))
			return (0);
		//тут запускаем рекурсивную фунцию,
		//которая перебирает варианты размещения тетрамино
		if (ft_tetramino(tet, map) == 1)
		{
			ft_print_figure(map);
			break ;
		}
		//если не один вариант не подходит увеличиваем размер карты
		ft_free_arr(map);
		++side; 
	}
	return (1);
}
